{
    "1": {
        "Qestion": "Q: If a red house is made of red bricks, a blue house is made of blue bricks, and a pink house is made of pink bricks, what is a green house made of?",
        "Awnser": "Glass."
    },
    "2": {
        "Qestion": "Q: I'm where yesterday follows today, and tomorrow's in the middle. What am I?",
        "Awnser": "A dictionary."
    },
    "3": {
        "Qestion": "Q: Eskimos are very good hunters, but they never hunt penguins. Why not?",
        "Awnser": "Because Eskimos live at the north pole, and penguins live in the south pole."
    },
    "4": {
        "Qestion": "Q: It goes in dry, it comes out wet, the longer it's in the stronger it gets. What is it?",
        "Awnser": "Tea-bag"
    },
    "5": {
        "Qestion": "Q: The peacock is a bird that does not lay eggs. How do they get baby peacocks?",
        "Awnser": "The peahen lays eggs."
    },
    "6": {
        "Qestion": "Q: Where do fish keep their money?",
        "Awnser": "The River Bank"
    },
    "7": {
        "Qestion": "Q: Which is heavier a ton of gold or a ton of silver?",
        "Awnser": "Both are equal. 1 ton = 1 ton"
    },
    "8": {
        "Qestion": "Q: What did one eye say to the other?",
        "Awnser": "Between us something smells."
    },
    "9": {
        "Qestion": "Q: What was the President's name in 1975?",
        "Awnser": "The same as it is today."
    },
    "10": {
        "Qestion": "Q: There are 6 mangoes in a basket and 6 kids eagerly waiting to get one. Each kid is given 1 mango, yet there is one mango in the basket, how?",
        "Awnser": "The last kid gets the basket with the mango in it."
    },
    "11": {
        "Qestion": "Q: 2 fathers and 2 sons go fishing. Each of them catches one fish. So why do they bring home only 3 fish?",
        "Awnser": "Because the fishing group comprises a grandfather, his son, and his grandson - hence, just three people."
    },
    "12": {
        "Qestion": "Q: You can hold it without using your hands or arms. What is it?",
        "Awnser": "Your breath."
    },
    "13": {
        "Qestion": "Q: I stand when I'm sitting, and jump when I'm walking. Who am I?",
        "Awnser": "A kangaroo."
    },
    "14": {
        "Qestion": "Q: A certain five letter word becomes shorter when you add two letters to it. What is the word?",
        "Awnser": "Short."
    },
    "15": {
        "Qestion": "Q: How long is the answer to this question.",
        "Awnser": "How long."
    },
    "16": {
        "Qestion": "Q: How many seconds are there in a year?",
        "Awnser": "Twelve. The Second of Jan, Feb, March...December."
    },
    "17": {
        "Qestion": "Q: Is it legal for a man to marry his widow's sister?",
        "Awnser": "No. He is dead."
    },
    "18": {
        "Qestion": "Q: Why is it against the law for a person living in New York to be buried in California?",
        "Awnser": "He is alive"
    },
    "19": {
        "Qestion": "Q: What goes up but never comes down?",
        "Awnser": "Your age."
    },
    "20": {
        "Qestion": "Q: You throw away the outside and cook the inside. Then you eat the outside and throw away the inside. What did you eat?",
        "Awnser": "An ear of corn."
    },
    "21": {
        "Qestion": "Q: What travels around the world but stays in one spot?",
        "Awnser": "A stamp!"
    },
    "22": {
        "Qestion": "Q: What do the letter 't' and an island have in common?",
        "Awnser": "Both are in water — WaTer."
    },
    "23": {
        "Qestion": "Q: I go all around the world but I still stay in a corner. Who am I?",
        "Awnser": "A postage stamp."
    },
    "24": {
        "Qestion": "Q: Which month has 28 days?",
        "Awnser": "All"
    },
    "25": {
        "Qestion": "Q: What is in the middle of CHINA?",
        "Awnser": "The letter"
    },
    "26": {
        "Qestion": "Q: What clothes did Delaware?",
        "Awnser": "Don't know. Alaska! (I'll ask her)."
    },
    "27": {
        "Qestion": "Q: When you have me, you feel like sharing me. But, if you do share me, you don't have me. What am I?",
        "Awnser": "A secret."
    },
    "28": {
        "Qestion": "Q: A cowboy rode into town on Friday, stayed three days, and rode out again on Friday. How did he do that?",
        "Awnser": "His horse's name is Friday."
    },
    "29": {
        "Qestion": "Q: The person who makes it has no need for it. The person who purchases it does not use it. The person who does use it does not know he or she is. What is it?",
        "Awnser": "A coffin."
    },
    "30": {
        "Qestion": "Q: It is an insect, and the first part of its name is the name of another insect. What is it?",
        "Awnser": "Beetle."
    },
    "31": {
        "Qestion": "Q: 20 pigeons sat on the branches of a tree. A man shot 1 pigeon with his gun. How many were left on the tree?",
        "Awnser": "None. The rest flew away."
    },
    "32": {
        "Qestion": "Q: If an electric train is traveling south, which way is the smoke going?",
        "Awnser": "There is no smoke, it's an electric train!"
    },
    "33": {
        "Qestion": "Q: What's black when you get it, red when you use it, and white when you're all through with it?",
        "Awnser": "Charcoal."
    },
    "34": {
        "Qestion": "Q: Heavy it is but reverse it's not?",
        "Awnser": "TON"
    },
    "35": {
        "Qestion": "Q: When was it that Christmas and New Year were celebrated in the same year?",
        "Awnser": "Every year."
    },
    "36": {
        "Qestion": "Q: How many time can you subtract 10 from 100?",
        "Awnser": "Once. Next time you would be subtracting 10 from 90."
    },
    "37": {
        "Qestion": "Q: Adam's mother had three children. The first child was named April. The second child was named May. What was the third child's name?",
        "Awnser": "Adam."
    },
    "38": {
        "Qestion": "Q: A clerk at a butcher shop stands five-feet ten-inches tall and wears size 13 sneakers. What does he weigh?",
        "Awnser": "Meat."
    },
    "39": {
        "Qestion": "Q: What types of words are these: madam, civic, eye, level?",
        "Awnser": "They are palindromes; they read the same both ways."
    },
    "40": {
        "Qestion": "Q: What ends everything always?",
        "Awnser": "The alphabet"
    },
    "41": {
        "Qestion": "Q: Feed me and I live, give me drink and I die. What am I?",
        "Awnser": "Fire. If you keep adding fuel (feeding it) to the fire, it will keep burning. However, a little water will extinguish or kill it."
    },
    "42": {
        "Qestion": "Q: What are the next two letters in this series? J F M A M J J A S O",
        "Awnser": "N and D. These are initials of the months in a year."
    },
    "43": {
        "Qestion": "Q: Which came first, the chicken or the egg?",
        "Awnser": "The egg, since dinosaurs laid eggs long before there were chickens."
    },
    "44": {
        "Qestion": "Q: Before Mount Everest was discovered, what was the highest mountain on Earth?",
        "Awnser": "Mount Everest, of course! Irrespective of the discovery, Mount Everest remains the highest peak in the world."
    },
    "45": {
        "Qestion": "Q: While some months have just 30 days, others have 31 days. How many months have 28 days?",
        "Awnser": "Every month has 28 days."
    },
    "46": {
        "Qestion": "Q: What are two things you cannot have for breakfast?",
        "Awnser": "Lunch and dinner! One can only eat breakfast as an early morning meal; the rest would be called lunch and dinner. So, technically, one cannot have lunch or dinner for breakfast."
    },
    "47": {
        "Qestion": "Q: What is broken every time it's spoken?",
        "Awnser": "Silence. We often use the phrase 'to break a silence' when me mean there is noise or sound. Thus, every time someone speaks, we figuratively break the silence."
    },
    "48": {
        "Qestion": "Q: If I give you a group of three, one who is sitting down and will never get up. The second, who eats as much as is given to him, yet is always hungry. The third, who goes away and never returns. What are we?",
        "Awnser": "Stove, fire, smoke. Here 'stove' represents the one who is always sitting, 'fire' which eats or consumes everything and is yet hungry for more, and finally 'smoke' which gets flown away with air, only never to return."
    },
    "49": {
        "Qestion": "Q: What comes once in a minute, twice in a moment, but never in a thousand years?",
        "Awnser": "The letter M. The riddle questions the number of times the letter 1m' appears in the words, 'minute', 'moment', and 'years'."
    },
    "50": {
        "Qestion": "Q: What has a mouth but can't chew?",
        "Awnser": "River. It has a mouth, but it definitely cannot chew anything!"
    },
    "51": {
        "Qestion": "Q: What is as big as an elephant but weighs nothing at all?",
        "Awnser": "An elephant's shadow!"
    },
    "52": {
        "Qestion": "Q: I go through towns and hills but I never move. Who am I?",
        "Awnser": "Road. A road goes through most of the places, but never itself moves."
    },
    "53": {
        "Qestion": "Q: The more you take, the more you leave behind.",
        "Awnser": "Footsteps. The more you walk, the more traces you leave behind."
    },
    "54": {
        "Qestion": "Q: What did the fish say when he ran into a concrete wall?",
        "Awnser": "Damn! The poor fish banged into the wall."
    },
    "55": {
        "Qestion": "Q: What starts with a T, ends with a T, and has T in it?",
        "Awnser": "Teapot."
    },
    "56": {
        "Qestion": "Q: What English word retains the same pronunciation, even after you take away four of its five letters?",
        "Awnser": "Queue. When we remove mueue' from the word 'Queue', it still retains the sound of the letter 'Q', which is same as the word 'Queue'."
    },
    "57": {
        "Qestion": "Q: If there are three cups of sugar and you take one away, how many do you have?",
        "Awnser": "One, as that is the only one you took away and that is all that you have. The rest still remain where there were."
    },
    "58": {
        "Qestion": "Q: How many letters are in the alphabet?",
        "Awnser": "We meant the word 'alphabet' and not the series of alphabets. So, the right answer is 8."
    },
    "59": {
        "Qestion": "Q: Take away the whole and some still remains. What is it?",
        "Awnser": "The word 'wholesome.' If you remove the 'whole' or the first part of the word, 'some' will still remain as an independent word."
    },
    "60": {
        "Qestion": "Q: How do you double your money in the easiest and fastest way?",
        "Awnser": "Place it in front of the mirror! The reflection will make it look like there is twice as much as actual money. "
    },
    "length": 60
}